/*jslint white: true */
function toggleServiceDetails(el){
    $('.serviceDetailsContainer').hide();
    var serviceObj = {
        environmnent:'Οι παρεχόμενες υπηρεσίες στον τομέα του Περιβάλλοντος αφορούν :<ul> <li> Μελέτες Περιβαλλοντικών Επιπτώσεων (Μ.Π.Ε.) έργων και δραστηριοτήτων.</li> <li> Στρατηγικές Μ.Π.Ε. προγραμμάτων και σχεδίων (χωροταξικών / πολεοδομικών).</li> <li>Ειδικές Περιβαλλοντικές Μελέτες για την οριοθέτηση & διαχείριση προστατευόμενων περιοχών (Natura 2000, κλπ.).</li> <li>Περιβαλλοντική παρακολούθηση (monitoring) τεχνικών και περιβαλλοντικών έργων.</li></ul>',
        garbage:'Οι παρεχόμενες υπηρεσίες στον τομέα της Διαχείρισης Αποβλήτων αφορούν :<ul> <li> Σχεδιασμός συστημάτων επεξεργασίας & διάθεσης λυμάτων (βιομηχανιών, ξενοδοχείων, κ.λπ.).</li> <li> Σχεδιασμός και αδειοδότηση συστημάτων α) συλλογής - μεταφόρτωσης - μεταφοράς και β) επεξεργασίας - διάθεσης στερεών αποβλήτων.</li> <li>Μελέτες αποκατάστασης υφιστάμενων Χώρων Διάθεσης Απορριμμάτων (χωματερές - σκουπιδότοποι).</li> <li>Ολοκληρωμένα σχέδια διαχείρισης αποβλήτων (σε Δήμους, λιμενικές εγκαταστάσεις, κλπ).</li><li> Μελέτες εκτίμησης και μείωσης θορύβου & αέριων ρύπων.</li></ul<p>Η <strong>ENCON</strong> διαθέτει μεγάλη εμπειρία στον σχεδιασμό συστημάτων συλλογής, επεξεργασίας και διάθεσης αποβλήτων και αναπτύσσει καινοτόμες λύσεις για όλα τα ζητήματα διαχείρισής τους. Υποστηρίζουμε τους πελάτες μας, από τον δημόσιο και τον ιδιωτικό τομέα, για να εφαρμόσουν <strong>πρακτικές ολοκληρωμένης διαχείρισης </strong> των αποβλήτων τους, που περιλαμβάνει: ελαχιστοποίηση παραγωγής - συλλογή και αποθήκευση - επεξεργασία - επαναχρησιμοποίηση - τελική διάθεση.</p><p>Συνεργαζόμαστε στενά με τους πελάτες μας για να θέσουμε έγκαιρα τους στόχους κάθε έργου, ώστε το προϊόν της μελέτης να ανταποκρίνεται πλήρως στις επιθυμίες και τον</p><p>προγραμματισμό τους. Τα συστήματα επεξεργασίας αποβλήτων που σχεδιάζουμε έχουν ως βασική φιλοσοφία: η προστασία του περιβάλλοντος να επιτυγχάνεται με τις <strong>βέλτιστες τεχνικο-οικονομικά λύσεις </strong>, που κάθε φορά προσαρμόζονται στις ιδιαίτερες ανάγκες και απαιτήσεις του έργου.</p>',
        place:'Οι παρεχόμενες υπηρεσίες στον τομέα της Χωροταξίας - Πολεοδομίας αφορούν :<ul> <li> Μελέτες για Γενικά Πολεοδομικά Σχέδια (ΓΠΣ) και Σχέδια Χωρικής & Οικιστικής Οργάνωσης Ανοικτής Πόλης (ΣΧΟΟΑΠ) του Ν.2508/97 για Δήμους.</li> <li> Μελέτες για Τοπικά Χωρικά Σχέδια (ΤΧΣ) του Ν.4269/14 για Δήμους.</li> <li> Μελέτες για Ειδικά Χωρικά Σχέδια (ΕΧΣ) για τη χωρική οργάνωση και ανάπτυξη περιοχών που μπορεί να λειτουργήσουν ως υποδοχείς σχεδίων και έργων υπερτοπικής κλίμακας ή στρατηγικής σημασίας.</li> <li>Ρυμοτομικά Σχέδια Εφαρμογής (ΡΣΕ) για την πολεοδόμηση συγκεκριμένης περιοχής.</li></ul',
        develop:'Οι παρεχόμενες υπηρεσίες στον τομέα των Αναπτυξιακών Μελετών αφορούν :<ul> <li> Ολοκληρωμένα Τοπικά Αναπτυξιακά Προγράμματα για Δήμους.</li> <li> Χωρική οργάνωση, σχεδιασμός (mester plan) και αδειοδότηση μεγάλων ιδιωτικών επενδύσεων (τουριστικών και οικιστικών).</li> <li> Μελέτες ανάδειξης και ανάπτυξης προστατευόμενων περιοχών.</li> </ul<p>Η χωροθέτηση και ανάπτυξη μεγάλων επενδύσεων γίνεται μέσω της μελέτης και έγκρισης Ειδικών Χωρικών Σχεδίων (ΕΧΣ) του Ν.4269/14, με τα οποία καθορίζονται χρήσεις γης, γενικοί όροι και περιορισμοί δόμησης καθώς και κάθε άλλο μέτρο, όρος ή περιορισμός που απαιτείται ώστε να καταστούν συγκεκριμένες περιοχές κατάλληλες είτε για τη δημιουργίαοργανωμένων υποδοχέων δραστηριοτήτων είτε για την πραγματοποίηση προγραμμάτων και παρεμβάσεων μεγάλης κλίμακας ή στρατηγικής σημασίας. ΕΧΣ αποτελούν και :</p><p>Συνεργαζόμαστε στενά με τους πελάτες μας για να θέσουμε έγκαιρα τους στόχους κάθε έργου, ώστε το προϊόν της μελέτης να ανταποκρίνεται πλήρως στις επιθυμίες και τον</p><p>προγραμματισμό τους. Τα συστήματα επεξεργασίας αποβλήτων που σχεδιάζουμε έχουν ως βασική φιλοσοφία: η προστασία του περιβάλλοντος να επιτυγχάνεται με τις <strong>βέλτιστες τεχνικο-οικονομικά λύσεις </strong>, που κάθε φορά προσαρμόζονται στις ιδιαίτερες ανάγκες και απαιτήσεις του έργου.</p><ul> <li>οι Περιοχές Ολοκληρωμένης Τουριστικής Ανάπτυξης (ΠΟΤΑ) του Ν.2545/97</li> <li> οι Περιοχές Οργανωμένης Ανάπτυξης Παραγωγικών Δραστηριοτήτων (ΠΟΑΠΔ) του Ν.1650/86</li> <li> τα Επιχειρηματικά Πάρκα του Ν.3982/11</li> <li> τα Εμπορευματικά Κέντρα του Ν.3333/05</li> <li> τα Ειδικά Σχέδια Χωρικής Ανάπτυξης Δημοσίων Ακινήτων (ΕΣΧΑΔΑ) του Ν.3986/11</li> <li> τα Ειδικά Σχέδια Χωρικής Ανάπτυξης Στρατηγικών Επενδύσεων (ΕΣΧΑΣΕ) του Ν.3894/10</li></ul>'
    };
    var thisId = $(el).parent().attr('id');
    if(thisId === "envService"){
        
        $('#serviceDetails').html(serviceObj.environmnent);
    }
    if(thisId === "garbService"){
        $('#serviceDetails').html(serviceObj.garbage);
    }
    if(thisId === "placeService"){
        $('#serviceDetails').html(serviceObj.place);
    }
    if(thisId === "devService"){
        $('#serviceDetails').html(serviceObj.develop);
    }
   
    $('.serviceDetailsContainer').slideToggle(300,"linear");
    
       
}
// function to create the select feeling in portfolio menu
function activeButton(el)  
{   'use strict';    
    $( ".porfolioSection .active" ).each(function(i) {
      $( this ).removeClass( "active" );
    });
    showPortfolioDetails(el);
    $(el).addClass('active');
}
function showPortfolioDetails(el){
    var thisId = $(el).attr('id');
    initializePortfolioDetails(thisId);
}
function initializePortfolioDetails(portfolioDetail){
    
    var general = '<p>Το μελετητικό γραφείο ENCON Σύμβουλοι & Μηχανικοί Περιβάλλοντος (Δ. ΜΠΑΜΠΟΣ & ΣΥΝΕΡΓΑΤΕΣ Ε.Ε.) έχει έδρα την Αθήνα και στελεχώνεται από επιστήμονες με σημαντική μελετητική εμπειρία. Πρόκειται για ένα γραφείο συμβούλων & μηχανικών το οποίο ειδικεύεται σε μελέτες & έργα σχετικά με την προστασία του περιβάλλοντος. Η εταιρία είναι μέλος του Τεχνικού Επιμελητηρίου Ελλάδος (Α.Μ. ΤΕΕ 6065), ενώ είναι εγγεγραμμένη στο Μητρώο Εταιρειών Μελετών του ΥΠΕΧΩΔΕ (Α.Μ. 698) και διαθέτει πτυχίο στις κάτωθι κατηγορίες μελετών:Σκοπός του γραφείου είναι η παροχή υψηλού επιπέδου υπηρεσιών στον τομέα της προστασίας & διαχείρισης του περιβάλλοντος, δίνοντας ολοκληρωμένες λύσεις σε θέματα διαχείρισης στερεών & υγρών αποβλήτων, καταρτίζοντας σχέδια προστασίας περιοχών και εφαρμόζοντας συστήματα περιβαλλοντικής διαχείρισης, για δημόσιους & ιδιωτικούς φορείς.'+
'</p><p>Βασική φιλοσοφία μας είναι η ολοκληρωμένη αντιμετώπιση των περιβαλλοντικών – χωροταξικών ζητημάτων, μέσω της πολύπλευρης επιστημονικής θεώρησής τους από ένα εξειδικευμένο και αποτελεσματικό σχήμα. Η στελέχωση της εταιρείας έγινε από επιστήμονες διαφόρων ειδικοτήτων (περιβαλλοντολόγος, μηχανικός περιβάλλοντος, πολιτικός μηχανικός, χημικός μηχανικός, γεωγράφος) ώστε να εξασφαλίζεται η διεπιστημονική προσέγγιση που απαιτείται στις περιβαλλοντικές & χωροταξικές μελέτες.</p>';
    var environment = '<h5>Το γραφείο έχει εκπονήσει περισσότερες από 120 μελέτες περιβαλλοντικών επιπτώσεων (ΜΠΕ) τόσο για δημόσια έργα, όσα και για ιδιωτικές επενδύσεις.</h5><p>Ενδεικτικές μελέτες της κατηγορίας αυτής είναι :</p><ol><li> Τεχνικός Σύμβουλος για την περιβαλλοντική παρακολούθηση της λειτουργίας του Χ.Υ.Τ.Α. Βόρειας Εύβοιας.</li><li> Στρατηγικές Μελέτες Περιβαλλοντικών Επιπτώσεων (ΣΜΠΕ) για τα Γενικά Πολεοδομικά Σχέδια (ΓΠΣ / ΣΧΟΟΑΠ) των Δήμων Αιδηψού, Παρνασσού και Καλλιέων.</li><li> Περιβαλλοντική αδειοδότηση των Αλυκών Κίτρους (Ν. Πιερίας), Αγγελοχωρίου (Ν. Θεσσαλονίκης), Νέας Κεσσάνης (Ν. Ξάνθης), Μέσης (Ν. Ροδόπης), Καλλονής (Ν. Λέσβου), Πολιχνίτου (Ν. Λέσβου) και Λήμνου.</li><li> Ειδική Οικολογική Αξιολόγηση (ΕΟΑ) για τα έργα στις Αλυκές Κίτρους και Λήμνου.</li><li> Μ.Π.Ε. για την επέκταση των Λιμενικών Εγκαταστάσεων Μούδρου.</li><li> Μελέτες Περιβαλλοντικών Επιπτώσεων για 13 έργα οδοποιίας σε Λέσβο, Κυκλάδες, Αίγινα και Φωκίδα.</li><li> Μ.Π.Ε. για την βελτίωση τμημάτων της Επαρχιακής Οδού Παπάδου - Πλωμαρίου.</li><li> Μ.Π.Ε. για τις βελτιωτικές εργασίες στρώσης στη νέα Σιδηροδρομική Γραμμή μεταξύ Τοξοτών - Ξάνθης.</li><li> Μ.Π.Ε. για την Ανάπτυξη της Πολεοδομημένης Έκτασης (300 στρ.) στη θέση "Ασπαλαθιά" του Δ.Δ. Εληάς του Δήμου Γουβών Ν. Ηρακλείου.</li><li> Αδειοδότηση μονάδων αφαλάτωσης στην Ύδρα (1.600 m3/ημέρα) και στην Αίγινα (2.000 m3/ημέρα).</li><li> Περιβαλλοντική αδειοδότηση 30 ξενοδοχείων σε Ύδρα, Λέσβο, Κυκλάδες, Εύβοια, Κρήτη, Μεσσηνία και Ιόνια.</li><li> Περιβαλλοντική αδειοδότηση 5 camping και κατασκηνώσεων σε Αίγινα, Πόρο, Κύθηρα και Ανάφη.</li><li> Περιβαλλοντική αδειοδότηση 20 βιομηχανικών / βιοτεχνικών μονάδων και επαγγ. εργαστηρίων (σφαγείων, ποτοποιείων, οικοδομικών υλικών, ζωοτροφών, κ.α.).</li><li> Περιβαλλοντική αδειοδότηση 15 έργων Α.Π.Ε. (αιολικών και φωτοβολταϊκών).</li></ol>';
    var develop = 'Οι παρεχόμενες υπηρεσίες στον τομέα των Αναπτυξιακών Μελετών αφορούν :<ul><li> Ολοκληρωμένα Τοπικά Αναπτυξιακά Προγράμματα για Δήμους.</li><li> Χωρική οργάνωση, σχεδιασμός (mester plan) και αδειοδότηση μεγάλων ιδιωτικών επενδύσεων (τουριστικών και οικιστικών).</li><li> Μελέτες ανάδειξης και ανάπτυξης προστατευόμενων περιοχών.</li></ul>Η χωροθέτηση και ανάπτυξη μεγάλων επενδύσεων γίνεται μέσω της μελέτης και έγκρισης Ειδικών Χωρικών Σχεδίων (ΕΧΣ) του Ν.4269/14, με τα οποία καθορίζονται χρήσεις γης, γενικοί όροι και περιορισμοί δόμησης καθώς και κάθε άλλο μέτρο, όρος ή περιορισμός που απαιτείται ώστε να καταστούν συγκεκριμένες περιοχές κατάλληλες είτε για τη δημιουργίαοργανωμένων υποδοχέων δραστηριοτήτων είτε για την πραγματοποίηση προγραμμάτων και παρεμβάσεων μεγάλης κλίμακας ή στρατηγικής σημασίας. ΕΧΣ αποτελούν και :<ul><li>οι Περιοχές Ολοκληρωμένης Τουριστικής Ανάπτυξης (ΠΟΤΑ) του Ν.2545/97</li><li> οι Περιοχές Οργανωμένης Ανάπτυξης Παραγωγικών Δραστηριοτήτων (ΠΟΑΠΔ) του Ν.1650/86</li><li> τα Επιχειρηματικά Πάρκα του Ν.3982/11</li><li> τα Εμπορευματικά Κέντρα του Ν.3333/05</li><li> τα Ειδικά Σχέδια Χωρικής Ανάπτυξης Δημοσίων Ακινήτων (ΕΣΧΑΔΑ) του Ν.3986/11</li><li> τα Ειδικά Σχέδια Χωρικής Ανάπτυξης Στρατηγικών Επενδύσεων (ΕΣΧΑΣΕ) του Ν.3894/10</li></ul>';
    var garbage='Ενδεικτικές μελέτες της κατηγορίας αυτής είναι :<ol> <li>Σχεδιασμός του Σταθμού Μεταφόρτωσης Απορριμμάτων (ΣΜΑ) του Δήμου Σπετσών.</li><li>Σχεδιασμός της Εγκατάστασης Επεξεργασίας Λυμάτων (ΕΕΛ) για τον οικισμό (1.100 ι.κ.) του Συνεταιρισμού Ιατρών στο Ν. Ηρακλείου.</li><li>Μελέτες επεξεργασίας & διάθεσης λυμάτων για 15 τουριστικές μονάδες (ξενοδοχεία και camping).</li><li>Κατασκευή Χ.Υ.Τ.Α. της 2ης Διαχειριστικής Ενότητας Ν. Πέλλας στη θέση "Νέο Κεφάλι" και αποκατάσταση του υφιστάμενου Χ.Α.Δ.Α. (Μελέτη Προσφοράς).</li><li>Εγκατάσταση Επεξεργασίας Λυμάτων (ΕΕΛ) Δήμου Μοιρών Ν. Ηρακλείου (Μελέτη Προσφοράς).</li><li>Οριστικές μελέτες αποκατάστασης για τους Χ.Α.Δ.Α. Ωρεών, Νέου Πύργου και Καστανιώτισσας του Δήμου Ωρεών Ν. Ευβοίας.</li><li>Κατάρτιση σχεδίου για την παραλαβή & διαχείριση αποβλήτων πλοίων στους λιμένες Ύδρας, Πόρου, Λουτρών Αιδηψού και Ωρεών.</li><li>Σύμβουλος Προγράμματος INTERREG III για την Ολοκληρωμένη Διαχείριση Υγρών Αγροτοκτηνοτροφικών Αποβλήτων στο Ν. Πρέβεζας και στο Ν. Λευκάδας.</li><li>Μελέτες για την οργάνωση & λειτουργία συστημάτων συλλογής - μεταφοράς στερεών αποβλήτων από ιδιώτες.</li><li>Διαχείριση Υγρών Αποβλήτων των Ελαιοτριβείων της νήσου Λέσβου</li></ol>';
    var place = '<div class="row">  <div class="col-xs-6 col-md-4 "> <a  class="thumbnail" > <img src="img/map.jpg" alt="..." onclick=enlargeImage(this,$(this).closest(".row").find("h4").text())> </a> </div> <div class="col-xs-12 col-md-8"><ul class="list-unstyled"><li><h4>Γενικό Πολεοδομικό Σχέδιο (ΓΠΣ) Δήμου Αιδηψού Ν. Ευβοίας</h4></li><li> Έκταση: 115.500 στρ. </li><li>Οικισμοί: 10</li><li> Κάτοικοι: 6.100 ή Πληθυσμός σχεδ.: 7.000 άτ.</li><li> Natura: Όχι</li></ul></div></div>'+
'<div class="row">  <div class="col-xs-6 col-md-4"> <a class="thumbnail"> <img src="img/map.jpg" alt="..." onclick=enlargeImage(this,$(this).closest(".row").find("h4").text())> </a> </div> <div class="col-xs-12 col-md-8"><ul class="list-unstyled"><li><h4>Σχέδιο Χωρικής & Οικιστικής Οργάνωσης Ανοικτής Πόλης (ΣΧΟΟΑΠ) Δήμου Παρνασσού Ν. Φωκίδας</h4></li><li>Έκταση: 87.100 στρ. </li><li>Οικισμοί: 4</li><li> Κάτοικοι: 2.150</li><li> Natura: Ναι Εθνικό Πάρκο: Ναι</li></ul></div></div>'+
'<div class="row">  <div class="col-xs-6 col-md-4"> <a class="thumbnail"> <img src="img/map.jpg" alt="..." onclick=enlargeImage(this,$(this).closest(".row").find("h4").text())> </a> </div> <div class="col-xs-12 col-md-8"><ul class="list-unstyled"><li><h4>Σχέδιο Χωρικής & Οικιστικής Οργάνωσης Ανοικτής Πόλης (ΣΧΟΟΑΠ) Δήμου Καλλιέων Ν. Φωκίδας</h4></li><li>Έκταση: 183.300 στρ. </li><liΟικισμοί: 7</li><li> Κάτοικοι: 1.800</li><li> Natura: Ναι</li></ul></div></div>'+
'<div class="row">  <div class="col-xs-6 col-md-4"> <a class="thumbnail"> <img src="img/map.jpg" alt="..." onclick=enlargeImage(this,$(this).closest(".row").find("h4").text())> </a> </div> <div class="col-xs-12 col-md-8"><ul class="list-unstyled"><li><h4>Σχέδιο Χωρικής & Οικιστικής Οργάνωσης Ανοικτής Πόλης (ΣΧΟΟΑΠ) Δήμου Ωρεών Ν. Ευβοίας</h4></li><li> Έκταση: 49.900 στρ.</li><li>Οικισμοί: 4</li><li>Κάτοικοι: 3.000</li><li> Natura: Όχι</li></ul></div></div>'+
'<div class="row">  <div class="col-xs-6 col-md-4"> <a class="thumbnail"> <img src="img/map.jpg" alt="..." onclick=enlargeImage(this,$(this).closest(".row").find("h4").text())> </a> </div> <div class="col-xs-12 col-md-8"><ul class="list-unstyled"><li><h4>Τοπικό Ρυμοτομικό Σχέδιο για το Νεκροταφείο «Παναγίας Κεράς» Δήμου Κυθήρων</h4></li></ul></div></div>';
    if(portfolioDetail === 'general'){
        portfolioDetail = general;
    }
    if(portfolioDetail === 'environment'){
        portfolioDetail = environment;
    }
    if(portfolioDetail === 'develop'){
        portfolioDetail = develop;
    }
    if(portfolioDetail === 'garbage'){
        portfolioDetail = garbage;
    }
    if(portfolioDetail === 'place'){
        portfolioDetail = place;
    }
    var portfolioText =  $('#portfolioDetails').html(portfolioDetail);   
    return portfolioText;
    
}

function enlargeImage(image,thumbnailTitle){
    $('#imagepreview').attr('src', $(image).attr('src'));
    $('#myModalLabel').text(thumbnailTitle);
    $('#imagemodal').modal('show');
}